; domain
(define (domain logistics)
  (:requirements :strips :typing)
  (:types city location physobj vehicle package airport)
  (:predicates
    (loc ?l - location ?c - city)
    (at ?x - physobj ?l - location)
    (in ?p - package ?v - vehicle)
  )

  (:action load
    :parameters (?p - package ?v - vehicle ?l - location)
    :precondition (and (at ?p ?l) (at ?v ?l))
    :effect (and (not (at ?p ?l)) (in ?p ?v))
  )

  (:action unload
    :parameters (?p - package ?v - vehicle ?l - location)
    :precondition (and (in ?p ?v) (at ?v ?l))
    :effect (and (not (in ?p ?v)) (at ?p ?l))
  )

  (:action drive
    :parameters (?v - vehicle ?from - location ?to - location ?c - city)
    :precondition (and (at ?v ?from) (loc ?from ?c) (loc ?to ?c))
    :effect (and (not (at ?v ?from)) (at ?v ?to))
  )

  (:action fly
    :parameters (?v - vehicle ?from - location ?to - location)
    :precondition (at ?v ?from)
    :effect (and (not (at ?v ?from)) (at ?v ?to))
  )
)

; problem
(define (problem logistics-2)
  (:domain logistics)
  (:objects
    pkg1 pkg2 - object
    truck1 - truck
    plane1 - airplane
    loc1 - location
    airport1 airport2 - airport
    city1 city2 - city
  )
  (:init
    (at truck1 airport1)
    (at plane1 airport1)
    (at pkg1 airport1)
    (at pkg2 airport1)

    ;; Add the location relationships
    (loc airport1 city1)
    (loc airport2 city2)
    (loc loc1 city1)

    ;;Important: Link the cities
    (loc city1 city2)
  )
  (:goal (and (at pkg1 airport2) (at pkg2 airport2))))

; plan
1. (load pkg1 plane1 airport1)
   deleted: (at pkg1 airport1)
   added: (in pkg1 plane1)
   goals met: 0 of 2
2. (load pkg2 plane1 airport1)
   deleted: (at pkg2 airport1)
   added: (in pkg2 plane1)
   goals met: 0 of 2
3. (fly plane1 airport1 airport2)
   deleted: (at plane1 airport1)
   added: (at plane1 airport2)
   goals met: 0 of 2
4. (unload pkg1 plane1 airport2)
   deleted: (in pkg1 plane1)
   added: (at pkg1 airport2)
   goals met: 1 of 2
5. (unload pkg2 plane1 airport2)
   deleted: (in pkg2 plane1)
   added: (at pkg2 airport2)
   goals met: 2 of 2
